app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1  [["user_id", 1]]
---
  def index
    @user = current_user
    @groups = Group.includes([:payments]).where(user_id: @user.id)

INSERT INTO "groups" ("name", "icon", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @group = Group.create(group_params)
    @group.user_id = current_user.id
    if @group.save