app/controllers/payments_controller.rb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @group = Group.find_by(id: params[:group_id])

SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1  [["user_id", 1]]
---
  def new
    @payment = Payment.new
    @groups = current_user.group

INSERT INTO "payments" ("name", "amount", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Burger"], ["amount", 12], ["user_id", 1], ["created_at", "2023-04-27 14:40:44.871425"], ["updated_at", "2023-04-27 14:40:44.871425"]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    @payment = Payment.create(payment_params)
    @group = Group.find(params[:payment][:group_id])
    @payment.user_id = @group.user_id
    @group.payments << @payment